Билет3/src/Documents/УстановкаМетодаРС/УстановкаМетодаРС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаМетодаРС</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.УчетнаяПолитика</registerRecords>
  <attributes>
    <name>МетодРС</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </attributes>
</mdclass:Document>

Билет3/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодРС</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Билет3/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет3/src/Enums/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетнаяПолитика</name>
  <enumValues>
    <name>Сред</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
</mdclass:Enum>

Билет3/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет3/src/Documents/УстановкаМетодаРС/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//установка метода РС
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.МетодРС = МетодРС;
	//если метод РС по Сред тогда перепроводим все записи в РН остатки с пустой партией
	
	Если МетодРС = Перечисления.УчетнаяПолитика.Сред Тогда
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		
		//БлокировкаД
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать(); 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиНоменклатурыОстатки.СебестоимостьОстаток КАК СебестоимостьОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени, ) КАК ОстаткиНоменклатурыОстатки
			|ИТОГИ
			|	СУММА(КоличествоОстаток),
			|	СУММА(СебестоимостьОстаток)
			|ПО
			|	Номенклатура";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			Выборка = ВыборкаНоменклатура.Выбрать();
		
			Пока Выборка.Следующий() Цикл
				// расходуем детальные записи по партиям
				Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.Партия = Выборка.Партия;
				Движение.Количество = Выборка.КоличествоОстаток;
				Движение.Себестоимость = Выборка.СебестоимостьОстаток;
			КонецЦикла; 
			
			//приходуем итоговые записи по номенклатуреа
			Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			Движение.Партия = Документы.ПриходнаяНакладная.ПустаяСсылка();
			Движение.Количество = ВыборкаНоменклатура.КоличествоОстаток;
			Движение.Себестоимость = ВыборкаНоменклатура.СебестоимостьОстаток;

		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
